from random import randint

import my_utils2 as mu2
import my_games as mg


if __name__ == '__main__':

    print("\n---=== Математический модуль ===---")
    csv_file = 'numbers3.csv'
    json_file = 'result.json'

    print(mu2.find_roots(1, -1, -1))  # вычисляем для проверки x^2-x-1=0

    mu2.generate_csv(csv_file, 500)  # генерируем файл 500 строк

    # print(mu2.my_read_csv(csv_file))  # Нужны были в процессе отладки
    # mu2.find_roots_with_2decos(csv_file, json_file)

    mu2.find_roots_with_all_decorators(csv_file, json_file)

    print("\n---=== Шахматный модуль ===---")

    chess_q8_test_list = [
        (7, 1),
        (1, 2),
        (3, 3),
        (8, 4),
        (6, 5),
        (4, 6),
        (2, 7),
        (5, 8),
    ]

    print(f'Расстановка 8 ферзей на доске{" не" if not mg.q8_test(chess_q8_test_list) else ""} корректна!')
    print("Отображение поля:")
    mg.print_chess_desk(chess_q8_test_list)

    print("\n4 удачные комбинации расстановки:")
    arrangement = mg.my_arrangement()
    for x in range(4):
        r = randint(0, len(arrangement))
        mg.print_chess_desk(arrangement[r])
        print(f'Координаты фигур: {arrangement[r]}, расстановка{" не" if not mg.q8_test(arrangement[r]) else ""}'
              f' корректна')
        print()

    print("\n---=== Игровой модуль ===---")
    mg.guess_the_number()

# Результат работы:
# C:\Work\python\dz3\Py3HW09\venv\Scripts\python.exe C:/Work/python/dz3/Py3HW09/main.py
#
# ---=== Математический модуль ===---
# (-0.6180339887498949, 1.618033988749895)
#
# ---=== Шахматный модуль ===---
# Расстановка 8 ферзей на доске корректна!
# Отображение поля:
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   | * |   |
# +---+---+---+---+---+---+---+---+
# | * |   |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   | * |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   |   | * |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   | * |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   | * |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   | * |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   | * |   |   |   |
# +---+---+---+---+---+---+---+---+
#
# 4 удачные комбинации расстановки:
# +---+---+---+---+---+---+---+---+
# |   |   | * |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   | * |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   | * |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   | * |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   |   | * |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   | * |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   | * |   |
# +---+---+---+---+---+---+---+---+
# | * |   |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# Координаты фигур: ((3, 1), (6, 2), (4, 3), (2, 4), (8, 5), (5, 6), (7, 7), (1, 8)), расстановка корректна
#
# +---+---+---+---+---+---+---+---+
# |   |   | * |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   | * |   |   |
# +---+---+---+---+---+---+---+---+
# |   | * |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   | * |   |
# +---+---+---+---+---+---+---+---+
# | * |   |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   | * |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   |   | * |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   | * |   |   |   |
# +---+---+---+---+---+---+---+---+
# Координаты фигур: ((3, 1), (6, 2), (2, 3), (7, 4), (1, 5), (4, 6), (8, 7), (5, 8)), расстановка корректна
#
# +---+---+---+---+---+---+---+---+
# |   |   | * |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   | * |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   | * |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   |   | * |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   | * |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   | * |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   | * |   |
# +---+---+---+---+---+---+---+---+
# | * |   |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# Координаты фигур: ((3, 1), (5, 2), (2, 3), (8, 4), (6, 5), (4, 6), (7, 7), (1, 8)), расстановка корректна
#
# +---+---+---+---+---+---+---+---+
# |   |   |   |   | * |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   |   | * |
# +---+---+---+---+---+---+---+---+
# |   |   |   | * |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# | * |   |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   |   | * |   |
# +---+---+---+---+---+---+---+---+
# |   | * |   |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   |   |   |   | * |   |   |
# +---+---+---+---+---+---+---+---+
# |   |   | * |   |   |   |   |   |
# +---+---+---+---+---+---+---+---+
# Координаты фигур: ((5, 1), (8, 2), (4, 3), (1, 4), (7, 5), (2, 6), (6, 7), (3, 8)), расстановка корректна
#
#
# ---=== Игровой модуль ===---
# Угадай число от 0 до 1000, которое я задумало
# Введите число: 500
# Задуманное число больше 500. Осталось 10 попыток
# Введите число: 750
# Задуманное число больше 750. Осталось 9 попыток
# Введите число: 825
# Задуманное число больше 825. Осталось 8 попыток
# Введите число: 912
# Задуманное число меньше 912. Осталось 7 попыток
# Введите число: 875
# Задуманное число меньше 875. Осталось 6 попыток
# Введите число: 850
# Задуманное число больше 850. Осталось 5 попыток
# Введите число: 862
# Задуманное число больше 862. Осталось 4 попыток
# Введите число: 868
# Задуманное число больше 868. Осталось 3 попыток
# Введите число: 872
# Задуманное число меньше 872. Осталось 2 попыток
# Введите число: 870
# Задуманное число меньше 870. Осталось 1 попыток
# Введите число: 869
# Вы выиграли! Число 869 угадано верно!
#
# Process finished with exit code 0
